-- MariaDB dump 10.19  Distrib 10.9.1-MariaDB, for Win64 (AMD64)
--
-- Host: i7d105.p.ssafy.io    Database: sellerB
-- ------------------------------------------------------
-- Server version	10.8.3-MariaDB-1:10.8.3+maria~jammy

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `t_consulting`
--

DROP TABLE IF EXISTS `t_consulting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `t_consulting` (
  `consulting_seq` bigint(20) NOT NULL AUTO_INCREMENT,
  `consulting_end_date` datetime(6) DEFAULT NULL,
  `consulting_mod_user` varchar(255) DEFAULT NULL,
  `consulting_reg_user` varchar(255) DEFAULT NULL,
  `consulting_start_date` datetime(6) DEFAULT NULL,
  `consulting_state` varchar(20) DEFAULT 'waiting',
  `consultant_seq` bigint(20) DEFAULT NULL,
  `customer_seq` bigint(20) DEFAULT NULL,
  `product_seq` bigint(20) DEFAULT NULL,
  `customerq` int(11) DEFAULT NULL,
  PRIMARY KEY (`consulting_seq`),
  KEY `FK9ibo2dl1w184dqeeh6e579l28` (`consultant_seq`),
  KEY `FKjtm30hpbh0hvkebw4c7vg1oan` (`customer_seq`),
  KEY `FKdu7ccf9io3apwssbb4hw8d0ya` (`product_seq`),
  CONSTRAINT `FK9ibo2dl1w184dqeeh6e579l28` FOREIGN KEY (`consultant_seq`) REFERENCES `t_consultant` (`consultant_seq`),
  CONSTRAINT `FKdu7ccf9io3apwssbb4hw8d0ya` FOREIGN KEY (`product_seq`) REFERENCES `t_product` (`product_seq`),
  CONSTRAINT `FKjtm30hpbh0hvkebw4c7vg1oan` FOREIGN KEY (`customer_seq`) REFERENCES `t_customer` (`customer_seq`)
) ENGINE=InnoDB AUTO_INCREMENT=270 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_consulting`
--

LOCK TABLES `t_consulting` WRITE;
/*!40000 ALTER TABLE `t_consulting` DISABLE KEYS */;
INSERT INTO `t_consulting` VALUES
(1,'2022-08-12 14:05:01.268166','비회원','비회원','2022-08-12 13:38:42.510605','end',9,6,5,NULL),
(2,'2022-08-12 14:05:06.643798','비회원','비회원','2022-08-12 13:47:32.378620','end',9,6,5,NULL),
(4,'2022-08-12 14:46:16.693024','비회원','비회원','2022-08-12 14:08:05.469090','end',1,6,1,NULL),
(5,'2022-08-12 14:44:58.459539','비회원','비회원','2022-08-12 14:14:42.962378','end',9,6,5,NULL),
(6,'2022-08-12 14:45:26.095889','비회원','비회원','2022-08-12 14:28:38.747344','end',9,6,5,NULL),
(7,'2022-08-12 15:17:01.435350','비회원','비회원','2022-08-12 15:09:22.296946','noShow',9,6,5,NULL),
(8,'2022-08-12 15:29:17.743567','비회원','비회원','2022-08-12 15:17:10.930988','noShow',9,6,5,NULL),
(9,'2022-08-12 15:44:09.860006','비회원','비회원','2022-08-12 15:29:21.620841','noShow',9,6,5,NULL),
(10,'2022-08-12 07:15:27.617720','비회원','비회원','2022-08-12 15:44:25.827355','noShow',9,6,5,NULL),
(19,'2022-08-12 07:32:44.704771','비회원','비회원','2022-08-12 07:31:54.786330','noShow',9,6,5,NULL),
(20,'2022-08-12 07:33:01.071112','비회원','비회원','2022-08-12 07:33:01.071112','waiting',9,6,5,NULL),
(23,'2022-08-12 07:40:12.807392','비회원','비회원','2022-08-12 07:40:12.807392','waiting',9,6,5,NULL),
(26,'2022-08-12 16:55:34.323016','비회원','비회원','2022-08-12 16:55:34.323016','waiting',9,6,5,NULL),
(28,'2022-08-12 16:58:29.440057','비회원','비회원','2022-08-12 16:58:29.440057','waiting',9,6,5,NULL),
(29,'2022-08-12 08:01:15.912912','비회원','비회원','2022-08-12 08:01:15.912912','waiting',9,6,5,NULL),
(32,'2022-08-12 21:37:56.479561','비회원','비회원','2022-08-12 12:35:30.000592','noShow',9,6,5,NULL),
(33,'2022-08-12 12:40:02.317236','비회원','비회원','2022-08-12 12:39:40.655707','noShow',9,6,5,NULL),
(38,'2022-08-13 22:12:41.752294','비회원','비회원','2022-08-13 22:12:41.752294','waiting',9,6,5,NULL),
(39,'2022-08-13 13:23:27.203827','비회원','비회원','2022-08-13 13:23:27.203827','waiting',9,6,5,NULL),
(40,'2022-08-13 13:36:52.310631','비회원','비회원','2022-08-13 13:36:52.310631','waiting',9,6,5,NULL),
(41,'2022-08-13 15:17:36.675931','비회원','비회원','2022-08-13 15:17:36.675931','waiting',9,6,5,NULL),
(42,'2022-08-14 00:20:25.386156','비회원','비회원','2022-08-14 00:20:25.386156','waiting',9,6,5,NULL),
(212,'2022-08-17 03:39:50.137583','비회원','custom2','2022-08-17 03:39:48.574678','start',2,6,10,NULL),
(213,'2022-08-17 03:39:56.857441','custom2','custom2','2022-08-17 03:39:56.857441','waiting',2,6,10,NULL),
(217,'2022-08-17 04:01:34.549168','비회원','custom1','2022-08-17 04:01:31.019243','noShow',1,6,1,NULL),
(218,'2022-08-17 04:16:09.368867','custom1','custom1','2022-08-17 04:16:09.368867','waiting',1,6,1,NULL),
(219,'2022-08-17 04:16:29.036041','custom1','custom1','2022-08-17 04:16:29.036041','waiting',1,6,1,NULL),
(220,'2022-08-17 04:17:02.736905','비회원','custom1','2022-08-17 04:16:51.667220','noShow',1,6,1,NULL),
(221,'2022-08-17 04:17:08.185205','비회원','custom1','2022-08-17 04:17:05.376121','noShow',1,6,1,NULL),
(222,'2022-08-17 04:19:00.281529','비회원','비회원','2022-08-17 04:18:50.481742','noShow',1,6,1,NULL),
(223,'2022-08-17 04:22:17.811918','비회원','비회원','2022-08-17 04:22:06.027223','noShow',1,6,1,NULL),
(224,'2022-08-17 04:22:49.494157','비회원','비회원','2022-08-17 04:22:39.501868','noShow',1,6,1,NULL),
(225,'2022-08-17 04:47:02.505024','비회원','비회원','2022-08-17 04:46:57.049248','noShow',1,6,1,NULL),
(226,'2022-08-17 04:47:06.619761','비회원','비회원','2022-08-17 04:47:04.586290','noShow',1,6,1,NULL),
(227,'2022-08-17 04:55:46.603106','비회원','비회원','2022-08-17 04:55:46.603106','waiting',1,6,1,NULL),
(228,'2022-08-17 04:56:56.010910','custom1','custom1','2022-08-17 04:56:56.010910','waiting',1,6,1,NULL),
(229,'2022-08-17 04:58:24.413242','custom1','custom1','2022-08-17 04:58:24.413242','waiting',1,6,1,NULL),
(230,'2022-08-17 05:00:00.011628','custom1','custom1','2022-08-17 05:00:00.011628','waiting',1,6,1,NULL),
(231,'2022-08-17 05:01:13.015537','비회원','custom1','2022-08-17 05:01:03.548456','noShow',1,6,1,NULL),
(232,'2022-08-17 05:02:44.755723','비회원','custom1','2022-08-17 05:02:37.290746','noShow',1,6,1,NULL),
(233,'2022-08-17 05:26:57.207635','custom1','custom1','2022-08-17 05:26:57.207635','waiting',1,34,1,NULL),
(234,'2022-08-17 05:27:27.018412','custom1','custom1','2022-08-17 05:27:27.018412','waiting',1,34,1,NULL),
(235,'2022-08-17 05:28:36.084155','비회원','custom1','2022-08-17 05:28:34.504162','start',1,6,1,NULL),
(236,'2022-08-17 05:36:56.718827','비회원','custom1','2022-08-17 05:36:54.915058','start',1,6,1,NULL),
(237,'2022-08-17 05:46:00.020806','custom1','custom1','2022-08-17 05:46:00.020806','waiting',1,34,1,NULL),
(238,'2022-08-17 05:46:47.644482','비회원','비회원','2022-08-17 05:46:36.370084','noShow',1,34,1,NULL),
(239,'2022-08-17 05:46:57.747461','비회원','비회원','2022-08-17 05:46:50.892458','noShow',1,34,1,NULL),
(240,'2022-08-17 05:49:35.834388','비회원','custom1','2022-08-17 05:49:26.691659','noShow',1,6,1,NULL),
(241,'2022-08-17 05:55:45.113912','비회원','custom1','2022-08-17 05:55:44.409993','noShow',1,34,1,NULL),
(242,'2022-08-17 05:56:56.974763','비회원','custom1','2022-08-17 05:56:49.772859','noShow',1,6,1,NULL),
(243,'2022-08-17 05:59:18.655919','비회원','custom1','2022-08-17 05:59:17.106535','noShow',1,6,1,NULL),
(244,'2022-08-17 06:00:15.000499','비회원','custom1','2022-08-17 06:00:10.091549','noShow',1,6,1,NULL),
(245,'2022-08-17 06:04:16.039544','비회원','custom1','2022-08-17 06:04:05.144630','noShow',1,6,1,NULL),
(246,'2022-08-17 06:05:44.109629','비회원','custom1','2022-08-17 06:05:42.710903','start',1,6,1,NULL),
(247,'2022-08-17 06:06:09.472730','비회원','custom1','2022-08-17 06:06:07.822241','start',1,6,1,NULL),
(248,'2022-08-17 06:08:03.970807','비회원','custom1','2022-08-17 06:07:44.373609','start',1,6,1,NULL),
(249,'2022-08-17 06:19:33.327562','비회원','custom1','2022-08-17 06:19:30.328749','noShow',1,6,1,NULL),
(250,'2022-08-17 06:20:08.134673','비회원','custom1','2022-08-17 06:20:02.945843','noShow',1,6,1,NULL),
(251,'2022-08-17 06:20:13.052404','비회원','custom1','2022-08-17 06:20:10.025442','noShow',1,6,1,NULL),
(252,'2022-08-17 06:20:48.532433','비회원','custom1','2022-08-17 06:20:46.266734','noShow',1,6,1,NULL),
(253,'2022-08-17 06:21:18.892229','비회원','custom1','2022-08-17 06:21:15.527956','noShow',1,6,1,NULL),
(254,'2022-08-17 06:21:50.489714','비회원','custom1','2022-08-17 06:21:47.715758','noShow',1,6,1,NULL),
(255,'2022-08-17 06:41:39.930869','비회원','custom1','2022-08-17 06:41:31.863085','noShow',1,6,1,NULL),
(256,'2022-08-17 06:43:31.257102','비회원','custom1','2022-08-17 06:43:19.597750','noShow',1,6,1,NULL),
(257,'2022-08-17 06:44:40.820623','비회원','custom1','2022-08-17 06:44:30.605219','noShow',1,6,1,NULL),
(258,'2022-08-17 06:47:16.767667','비회원','비회원','2022-08-17 06:46:51.599209','noShow',1,34,1,NULL),
(259,'2022-08-17 06:48:16.341762','비회원','custom1','2022-08-17 06:48:09.582328','noShow',1,6,1,NULL),
(260,'2022-08-17 06:49:56.806481','비회원','비회원','2022-08-17 06:49:25.023132','end',1,34,1,NULL),
(261,'2022-08-17 06:50:18.062034','비회원','비회원','2022-08-17 06:50:07.923978','end',1,34,1,NULL),
(262,'2022-08-17 06:53:47.547788','비회원','custom1','2022-08-17 06:53:32.688137','noShow',1,6,1,NULL),
(263,'2022-08-17 07:15:50.711186','비회원','비회원','2022-08-17 07:13:09.830988','end',1,6,1,NULL),
(264,'2022-08-17 07:16:59.587812','비회원','비회원','2022-08-17 07:16:46.667614','end',1,6,1,NULL),
(265,'2022-08-17 07:40:46.385213','비회원','비회원','2022-08-17 07:40:24.381930','end',1,6,1,NULL),
(266,'2022-08-17 07:41:26.575938','비회원','비회원','2022-08-17 07:41:03.821742','end',1,6,1,NULL),
(267,'2022-08-17 07:53:53.787376','비회원','비회원','2022-08-17 07:53:33.334854','end',1,6,1,NULL),
(268,'2022-08-17 07:56:05.956627','비회원','비회원','2022-08-17 07:55:17.589762','end',1,6,1,NULL),
(269,'2022-08-17 08:02:14.908364','비회원','비회원','2022-08-17 08:00:19.665940','end',1,6,1,NULL);
/*!40000 ALTER TABLE `t_consulting` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-08-17 23:43:44
